
title: DNS Rebind from External
id: test-002
status: test
description: Detects DNS rebind from external source
logsource:
    product: router
detection:
    selection:
        event_type: DNS_QUERY
        category: rebind
    condition: selection
level: critical
tags:
    - attack.command_and_control
    - attack.t1071.004
